apps/backend/documentation/diagrams/CLASS.dbml
//// ------------------------------------------------------
//// THIS FILE WAS AUTOMATICALLY GENERATED (DO NOT MODIFY)
//// ------------------------------------------------------

Table addresses {
  id String [pk]
  latitude String [not null]
  longitude String [not null]
  created_at DateTime [default: `now()`, not null]
  updated_at DateTime [not null]
  school schools [not null]
  student students [not null]
}

Table schools {
  id String [pk]
  name String [not null]
  morning_arrival DateTime [not null]
  morning_departure DateTime [not null]
  afternoon_arrival DateTime [not null]
  afternoon_departure DateTime [not null]
  night_arrival DateTime [not null]
  night_departure DateTime [not null]
  adress_id String [not null]
  itinerary_id String [not null]
  created_at DateTime [default: `now()`, not null]
  updated_at DateTime [not null]
  adress addresses [not null]
  itinerary itineraries [not null]
  student students [not null]
}

Table users {
  id String [pk]
  email String [unique, not null]
  name String [not null]
  cellphone String [not null]
  code String [not null]
  created_at DateTime [default: `now()`, not null]
  driver_id String [not null]
  responsible_id String [not null]
  role_id String [not null]
  type String [not null]
  updated_at DateTime [not null]
  driver drivers [not null]
  responsible responsibles [not null]
  role roles [not null]
}

Table roles {
  id String [pk]
  name String [not null]
  created_at DateTime [default: `now()`, not null]
  updated_at DateTime [not null]
  user users [not null]
}

Table responsibles {
  id String [pk]
  created_at DateTime [default: `now()`, not null]
  updated_at DateTime [not null]
  user users [not null]
}

Table students {
  id String [pk]
  school_id String [not null]
  adress_id String [not null]
  created_at DateTime [default: `now()`, not null]
  updated_at DateTime [not null]
  afternoon Boolean [not null]
  goes Boolean [not null]
  morning Boolean [not null]
  night Boolean [not null]
  return Boolean [not null]
  student_itinerary student_itineraries [not null]
  student_trip student_trips [not null]
  adress addresses [not null]
  school schools [not null]
}

Table drivers {
  id String [pk]
  created_at DateTime [default: `now()`, not null]
  updated_at DateTime [not null]
  itinerary_id String [not null]
  itinerary itineraries [not null]
  user users [not null]
}

Table itineraries {
  id String [pk]
  monday Boolean [not null]
  tuesday Boolean [not null]
  wednesday Boolean [not null]
  thursday Boolean [not null]
  friday Boolean [not null]
  saturday Boolean [not null]
  morning Boolean [not null]
  afternoon Boolean [not null]
  night Boolean [not null]
  created_at DateTime [default: `now()`, not null]
  updated_at DateTime [not null]
  driver drivers [not null]
  school schools [not null]
  student_Itinerary student_itineraries [not null]
  trip trips [not null]
}

Table student_itineraries {
  student_id String [not null]
  itinerary_id String [not null]
  created_at DateTime [default: `now()`, not null]
  updated_at DateTime [not null]
  itinerary itineraries [not null]
  student students [not null]

  indexes {
    (student_id, itinerary_id) [pk]
  }
}

Table trips {
  id String [pk]
  path Json [not null]
  started_at DateTime [not null]
  finished_at DateTime [not null]
  created_at DateTime [default: `now()`, not null]
  updated_at DateTime [not null]
  itinerary_id String [not null]
  student_trip student_trips [not null]
  Itinerary itineraries [not null]
}

Table student_trips {
  id String [pk]
  embarked_at DateTime [not null]
  disembarked_at DateTime [not null]
  student_id String [not null]
  trip_id String [not null]
  created_at DateTime [default: `now()`, not null]
  updated_at DateTime [not null]
  student students [not null]
  trip trips [not null]
}

Table routes {
  id String [pk]
  name String [not null]
  distance Float [not null]
  duration Float [not null]
  directions Json [not null]
  source_id String [not null]
  source places [not null]
  destination_id String [not null]
  destination places [not null]
  created_at DateTime [default: `now()`, not null]
  updated_at DateTime [not null]
}

Table places {
  id String [pk]
  place_id String [not null]
  name String [not null]
  latitude Float [not null]
  longitude Float [not null]
  source routes [not null]
  destination routes [not null]
}

Ref: schools.adress_id > addresses.id

Ref: schools.itinerary_id > itineraries.id

Ref: users.driver_id > drivers.id

Ref: users.responsible_id > responsibles.id

Ref: users.role_id > roles.id

Ref: students.adress_id > addresses.id

Ref: students.school_id > schools.id

Ref: drivers.itinerary_id > itineraries.id

Ref: student_itineraries.itinerary_id > itineraries.id

Ref: student_itineraries.student_id > students.id

Ref: trips.itinerary_id > itineraries.id

Ref: student_trips.student_id > students.id

Ref: student_trips.trip_id > trips.id

Ref: routes.source_id > places.id

Ref: routes.destination_id > places.id
